In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({'Name':'Alice',
                     'Class':'Physics',
                     'Score':85})
record2 = pd.Series({'Name':'Jack',
                     'Class':'Chemistry',
                     'Score':82})
record3 = pd.Series({'Name':'Helen',
                     'Class':'Biology',
                     'Score':90})

In [3]:
df = pd.DataFrame([record1,record2,record3],
                 index=['school1','school2','school3'])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [4]:
students = [{
    'Name':'Alice',
    'Class':'Physics',
    'Score':85
},{
    'Name':'Jack',
    'Class':'Chemistry',
    'Score':82
},{
    'Name':'Helen',
    'Class':'Biology',
    'Score':90
}]
df = pd.DataFrame(students,index=['school1','school2','school3'])

In [5]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [6]:
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [7]:
type(df.loc['school2'])

pandas.core.series.Series

pandas.core.series.Series

In [10]:
df.loc['school1','Name']

'Alice'

In [11]:
df.T

       school1    school2  school3
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [13]:
df.T.loc['Name']

school1    Alice
school2     Jack
school3    Helen
Name: Name, dtype: object

In [14]:
df['Name']

school1    Alice
school2     Jack
school3    Helen
Name: Name, dtype: object

In [15]:
df.loc['school1']['Name']

'Alice'

In [16]:
df.loc[:,['Name','Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school3  Helen     90

In [17]:
df.drop('school1')

          Name      Class  Score
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [18]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [19]:
copy_df = df.copy()

In [20]:
copy_df.drop("Name",inplace=True,axis=1)
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school3    Biology     90

In [22]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [23]:
del copy_df['Score']

In [24]:
copy_df

             Class
school1    Physics
school2  Chemistry
school3    Biology

In [25]:
df['ClassRanking']=None

In [26]:
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school3  Helen    Biology     90         None